<div class="page">
<h1>Любимые фильмы</h1>
<h3>Хочется как один факт обо мне рассказать о свои любимых фильмах</h3>
<pre class="film1">В Лос-Анджелесе злодеи похищают малолетнюю дочь китайского консула, которую в Гонконге учил кунг-фу инспектор Ли. 
Консул вызывает Ли в Америку, чтобы тот принял участие в освобождении девочки. Агенты ФБР обратились к полиции с просьбой 
выделить им самого никчемного сотрудника, чтобы тот взял китайца на себя и показал ему достопримечательности, а главное, 
не позволил вмешиваться в их дела. Им оказывается самый болтливый полицейский Картер. Естественно, после ряда разногласий и 
недоразумений они объединяют усилия и всерьез берутся за вызволение заложницы.
Если уже догадались то это фильм: Час пик 1998 года
<img src="https://files.itv.uz/uploads/content/poster/2022/06/24/b33ff1ad9271426957315fd310355fac-q-700x1002.jpeg" alt="Час Пик" height="520" width="450">
Это один из моих любимых фильмов
<a class="links" href="https://gun.kinozadrot3.site/651-chas-pik-1998.html">Ссылка для просмотра</a></pre>
<pre class="film2">Во втором же фильмы говорится о  счастливом парне по имени Парень. 
Он живет в лучшем в мире городе Городе, работает на лучшей в мире работе в Банке и дружит 
с охранником по имени Приятель. И его совершенно не волнует, что Банк грабят по нескольку раз на дню, 
а улицы Города напоминают зону военных действий. Единственное, чего Парню не хватает для полного 
счастья — идеальной девушки, к которой у него имеется точный список требований. И вот однажды он видит на 
улице красотку, точь-в-точь как в его мечтах. Эта встреча изменит не только нашего главного героя, но и 
перевернёт весь известный ему мир.
<img src="https://cdn.fishki.net/upload/post/2021/08/03/3869205/freeguynewdate-01--1.jpg" alt="Час Пик" height="500" width="530">
Именно этот фильм находится на первом месте в моем списке, не смотря на множество других этот запомнился больше всех
<a class="links" href="https://n4.lord-serial1.pro/6191-geroj-mar-8-2024.html">Ссылка для просмотра</a></pre>
</div>
<style>
    .film1{
        border: 1px solid #8b8787;
        padding: 10px;
        box-shadow: 0 0 10px #eee;
        font-size: 19px;
    }
    .film2{
        border: 1px solid #8b8787;
        padding: 10px;
        box-shadow: 0 0 10px #eee;
        font-size: 19px;
    }
    .links{
        border: 1px solid black;
        border-radius: 10px;
        color: red;
    }
    .links:hover{
        border: 1px solid black;
        border-radius: 10px;
        color: rgb(255, 255, 255);
        background-color: red;
    }
</style>